Tekla.Structures.ModelInternal.BimModelDataProduct.CurieResult
Represents a result of a CURIE (Compact Uniform Resource Identifier) resolution.

Tekla.Structures.ModelInternal.BimModelDataProduct.CurieResult.Type
The type of the resource identified by the CURIE.

Tekla.Structures.ModelInternal.BimModelDataProduct.CurieResult.Identifier
The identifier of the resource, which is a unique string within the context of the type.